CSI API ETABS v1
cDStItalianNTC2008S Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDStItalianNTC2008S
Public Interface cDStItalianNTC2008S
Dim instance As cDStItalianNTC2008S
public interface class cDStItalianNTC2008S
type cDStItalianNTC2008S =  interface end
The cDStItalianNTC2008S type exposes the following members.
Methods
Name | Description
GetOverwrite
 Retrieves the value of a steel design overwrite item
GetPreference
 Retrieves the value of a steel design preference item.
SetOverwrite
 Sets the value of a steel design overwrite item
SetPreference
 Sets the value of a steel design preference item.
Top
See Also
Reference
ETABSv1 Namespace